performance/reports/archive/runs/normal-day-2026-08-17T14-44-53/summary.txt
     ✓ login 200
     ✓ board list 200
     ✓ chat rooms 200
     ✓ post detail 200
     ✓ hot daily 200
     ✓ comment create 2xx
     ✓ post list 200
     ✓ chat messages 200
     ✓ unread count 200
     ✓ meal today 200
     ✓ scrap 2xx
     ✓ comment list 200
     ✓ timetable today 200
     ✓ chat read 200
     ✓ logout 200
     ✓ post create 2xx
     ✓ post reaction 2xx
     ✓ friend list 200
     ✓ received reqs 200
     ✓ ws handshake 101
     ✓ post search 200
     ✓ notif list 200
     ✓ read one 200
     ✓ user info 200
     ✓ my posts 200
     ✓ comment reaction 200
     ✓ post update 200
     ✓ refresh 200
     ✓ post delete 200
     ✓ read all 200
     ✓ meal month 200

     auth_token_refreshes...........: 27      0.044089/s
     chat_ws_messages_sent..........: 747     1.219802/s
     chat_ws_rtt....................: avg=3.04s   min=14ms    med=2.47s    max=16.43s   p(90)=6.47s   p(95)=8.14s    p(99)=11.08s  
     checks.........................: 100.00% ✓ 12119     ✗ 0    
     ✓ { phase:measure }............: 100.00% ✓ 6539      ✗ 0    
     ✓ { phase:rampdown }...........: 100.00% ✓ 2361      ✗ 0    
     ✓ { phase:warmup }.............: 100.00% ✓ 3219      ✗ 0    
     data_received..................: 534 MB  872 kB/s
     data_sent......................: 4.9 MB  8.0 kB/s
     http_req_blocked...............: avg=24.4µs  min=1.09µs  med=5.31µs   max=45.09ms  p(90)=14.77µs p(95)=17.7µs   p(99)=306.68µs
     http_req_connecting............: avg=10.33µs min=0s      med=0s       max=25.63ms  p(90)=0s      p(95)=0s       p(99)=223.01µs
     http_req_duration..............: avg=5.44s   min=1.85ms  med=4.74s    max=36.25s   p(90)=11.04s  p(95)=13.3s    p(99)=17.85s  
       { expected_response:true }...: avg=5.44s   min=1.85ms  med=4.74s    max=36.25s   p(90)=11.04s  p(95)=13.3s    p(99)=17.85s  
     ✓ { feature:auth }.............: avg=2.7s    min=35.64ms med=2.06s    max=15.73s   p(90)=5.8s    p(95)=7.4s     p(99)=11.2s   
     ✓ { feature:board }............: avg=5.01s   min=2.29ms  med=4.48s    max=24.92s   p(90)=9.82s   p(95)=11.46s   p(99)=15.53s  
     ✓ { feature:chat }.............: avg=5.22s   min=2.52ms  med=4.61s    max=21.85s   p(90)=10.84s  p(95)=12.96s   p(99)=16.29s  
     ✓ { feature:comment }..........: avg=7.01s   min=1.85ms  med=5.82s    max=36.25s   p(90)=14.57s  p(95)=17.66s   p(99)=22.19s  
     ✓ { feature:friend }...........: avg=4.65s   min=3.63ms  med=4.15s    max=15.7s    p(90)=9.34s   p(95)=11.28s   p(99)=15.4s   
     ✓ { feature:hot }..............: avg=5.43s   min=10.34ms med=4.91s    max=20.61s   p(90)=10.69s  p(95)=12s      p(99)=16.05s  
     ✓ { feature:mypage }...........: avg=5.57s   min=2.66ms  med=4.59s    max=18.36s   p(90)=11.15s  p(95)=12.45s   p(99)=15.66s  
     ✓ { feature:notification }.....: avg=5.59s   min=2.47ms  med=5.13s    max=18.02s   p(90)=10.92s  p(95)=12.89s   p(99)=15.85s  
     ✓ { feature:post }.............: avg=5.11s   min=1.95ms  med=4.6s     max=23.64s   p(90)=10.48s  p(95)=12.02s   p(99)=15.91s  
     ✓ { feature:reaction }.........: avg=5.09s   min=17.23ms med=4.59s    max=16.32s   p(90)=10.11s  p(95)=11.76s   p(99)=15.44s  
     ✓ { feature:school }...........: avg=5.61s   min=2.74ms  med=4.56s    max=17.05s   p(90)=11.8s   p(95)=13.59s   p(99)=16.23s  
     ✓ { feature:scrap }............: avg=4.62s   min=19.05ms med=4.15s    max=15.48s   p(90)=9.22s   p(95)=11.05s   p(99)=13.65s  
     ✓ { feature:timetable }........: avg=5.1s    min=3.87ms  med=4.81s    max=14.41s   p(90)=8.53s   p(95)=9.88s    p(99)=11.65s  
     ✓ { op:auth }..................: avg=2.7s    min=35.64ms med=2.06s    max=15.73s   p(90)=5.8s    p(95)=7.4s     p(99)=11.2s   
     ✗ { op:read,phase:measure }....: avg=6.94s   min=2.94ms  med=6.21s    max=29.89s   p(90)=12.27s  p(95)=14.89s   p(99)=18.18s  
     ✗ { op:write,phase:measure }...: avg=7.46s   min=19.95ms med=7.03s    max=24.08s   p(90)=13.23s  p(95)=15.39s   p(99)=17.76s  
     ✓ { page:0 }...................: avg=3.93s   min=1.95ms  med=3.36s    max=16.54s   p(90)=7.67s   p(95)=10.21s   p(99)=13.98s  
     ✓ { page:1 }...................: avg=3.64s   min=2.19ms  med=2.94s    max=16.27s   p(90)=7.45s   p(95)=9.93s    p(99)=13.14s  
     ✓ { page:2 }...................: avg=4.01s   min=2.07ms  med=3.17s    max=17.63s   p(90)=7.83s   p(95)=10.17s   p(99)=14.14s  
     ✓ { page:3 }...................: avg=3.79s   min=2.27ms  med=3.48s    max=13s      p(90)=7.03s   p(95)=8.7s     p(99)=11.35s  
     ✓ { page:4 }...................: avg=4.21s   min=2.36ms  med=3.61s    max=15.93s   p(90)=7.88s   p(95)=9.03s    p(99)=15.92s  
     ✓ { phase:measure }............: avg=6.98s   min=2.94ms  med=6.27s    max=29.89s   p(90)=12.36s  p(95)=14.98s   p(99)=18.12s  
     ✓ { phase:rampdown }...........: avg=4.11s   min=1.85ms  med=3.17s    max=24.76s   p(90)=9.43s   p(95)=11.31s   p(99)=15.98s  
     ✓ { phase:warmup }.............: avg=3.34s   min=3.34ms  med=2.72s    max=36.25s   p(90)=7s      p(95)=8.56s    p(99)=15.46s  
     http_req_failed................: 0.00%   ✓ 0         ✗ 11987
     ✓ { phase:measure }............: 0.00%   ✓ 0         ✗ 6471 
     ✓ { phase:rampdown }...........: 0.00%   ✓ 0         ✗ 2170 
     ✓ { phase:warmup }.............: 0.00%   ✓ 0         ✗ 3346 
     http_req_receiving.............: avg=1.92ms  min=14.53µs med=206.74µs max=454.51ms p(90)=1.27ms  p(95)=3.92ms   p(99)=66.57ms 
     http_req_sending...............: avg=52.72µs min=4.91µs  med=28.77µs  max=38.93ms  p(90)=97.72µs p(95)=122.28µs p(99)=239.13µs
     http_req_tls_handshaking.......: avg=0s      min=0s      med=0s       max=0s       p(90)=0s      p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=5.44s   min=1.73ms  med=4.74s    max=36.17s   p(90)=11.04s  p(95)=13.3s    p(99)=17.84s  
     http_reqs......................: 11987   19.573978/s
     ✓ { feature:auth }.............: 291     0.475184/s
     ✓ { feature:board }............: 1089    1.778265/s
     ✓ { feature:chat }.............: 904     1.476172/s
     ✓ { feature:comment }..........: 2129    3.476516/s
     ✓ { feature:friend }...........: 184     0.30046/s
     ✓ { feature:hot }..............: 1089    1.778265/s
     ✓ { feature:mypage }...........: 184     0.30046/s
     ✓ { feature:notification }.....: 550     0.898114/s
     ✓ { feature:post }.............: 5064    8.269177/s
     ✓ { feature:reaction }.........: 226     0.369043/s
     ✓ { feature:school }...........: 112     0.182889/s
     ✓ { feature:scrap }............: 75      0.12247/s
     ✓ { feature:timetable }........: 90      0.146964/s
     ✓ { op:auth }..................: 291     0.475184/s
     ✓ { op:read }..................: 10759   17.568736/s
     ✓ { op:write }.................: 937     1.530059/s
     ✓ { page:0 }...................: 573     0.935671/s
     ✓ { page:1 }...................: 225     0.36741/s
     ✓ { page:2 }...................: 131     0.213914/s
     ✓ { page:3 }...................: 108     0.176357/s
     ✓ { page:4 }...................: 52      0.084913/s
     ✓ { phase:measure }............: 6471    10.566715/s
     ✓ { phase:rampdown }...........: 2170    3.543467/s
     ✓ { phase:warmup }.............: 3346    5.463797/s
     iteration_duration.............: avg=32.57s  min=1.29s   med=24.06s   max=2m4s     p(90)=1m11s   p(95)=1m22s    p(99)=1m40s   
     iterations.....................: 2801    4.573848/s
     ✓ { phase:measure }............: 0       0/s
     ✓ { phase:rampdown }...........: 0       0/s
     ✓ { phase:warmup }.............: 0       0/s
     phase_iterations...............: 2801    4.573848/s
     ✓ { phase:measure }............: 1539    2.513085/s
     ✓ { phase:rampdown }...........: 564     0.920975/s
     ✓ { phase:warmup }.............: 698     1.139788/s
     vus............................: 1       min=0       max=200
     vus_max........................: 200     min=200     max=200
     ws_connecting..................: avg=4.37s   min=4.7ms   med=3.75s    max=15s      p(90)=8.77s   p(95)=11.44s   p(99)=14.26s  
     ws_msgs_received...............: 757     1.236131/s
     ws_msgs_sent...................: 1011    1.650896/s
     ws_session_duration............: avg=27.14s  min=16.74s  med=27.54s   max=43.9s    p(90)=34.42s  p(95)=37.15s   p(99)=40.52s  
     ws_sessions....................: 132     0.215547/s